Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Saheeh International.tmx
Source language: ar
Languages: en

source: واعلموا أن فيكم رسول الله لو يطيعكم في كثير من الأمر لعنتم ولكن الله حبب إليكم الإيمان وزينه في قلوبكم وكره إليكم الكفر والفسوق والعصيان أولئك هم الراشدون
en: And know that among you is the Messenger of Allah. If he were to obey you in much of the matter, you would be in difficulty, but Allah has endeared to you the faith and has made it pleasing in your hearts and has made hateful to you disbelief, defiance and disobedience. Those are the [rightly] guided.

source: فضلا من الله ونعمة والله عليم حكيم
en: [It is] as bounty from Allah and favor. And Allah is Knowing and Wise.

source: وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما فإن بغت إحداهما على الأخرى فقاتلوا التي تبغي حتى تفيء إلى أمر الله فإن فاءت فأصلحوا بينهما بالعدل وأقسطوا إن الله يحب المقسطين
en: And if two factions among the believers should fight, then make settlement between the two. But if one of them oppresses the other, then fight against the one that oppresses until it returns to the ordinance of Allah. And if it returns, then make settlement between them in justice and act justly. Indeed, Allah loves those who act justly.

source: إنما المؤمنون إخوة فأصلحوا بين أخويكم واتقوا الله لعلكم ترحمون
en: The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.

source: يا أيها الذين آمنوا لا يسخر قوم من قوم عسى أن يكونوا خيرا منهم ولا نساء من نساء عسى أن يكن خيرا منهن ولا تلمزوا أنفسكم ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان ومن لم يتب فأولئك هم الظالمون
en: O you who have believed, let not a people ridicule [another] people; perhaps they may be better than them; nor let women ridicule [other] women; perhaps they may be better than them. And do not insult one another and do not call each other by [offensive] nicknames. Wretched is the name of disobedience after [one's] faith. And whoever does not repent - then it is those who are the wrongdoers.

source: يا أيها الذين آمنوا اجتنبوا كثيرا من الظن إن بعض الظن إثم ولا تجسسوا ولا يغتب بعضكم بعضا أيحب أحدكم أن يأكل لحم أخيه ميتا فكرهتموه واتقوا الله إن الله تواب رحيم
en: O you who have believed, avoid much [negative] assumption. Indeed, some assumption is sin. And do not spy or backbite each other. Would one of you like to eat the flesh of his brother when dead? You would detest it. And fear Allah; indeed, Allah is Accepting of repentance and Merciful.

source: يا أيها الناس إنا خلقناكم من ذكر وأنثى وجعلناكم شعوبا وقبائل لتعارفوا إن أكرمكم عند الله أتقاكم إن الله عليم خبير
en: O mankind, indeed We have created you from male and female and made you peoples and tribes that you may know one another. Indeed, the most noble of you in the sight of Allah is the most righteous of you. Indeed, Allah is Knowing and Acquainted.

source: قالت الأعراب آمنا قل لم تؤمنوا ولكن قولوا أسلمنا ولما يدخل الإيمان في قلوبكم وإن تطيعوا الله ورسوله لا يلتكم من أعمالكم شيئا إن الله غفور رحيم
en: The bedouins say, "We have believed." Say, "You have not [yet] believed; but say [instead], 'We have submitted,' for faith has not yet entered your hearts. And if you obey Allah and His Messenger, He will not deprive you from your deeds of anything. Indeed, Allah is Forgiving and Merciful."

source: إنما المؤمنون الذين آمنوا بالله ورسوله ثم لم يرتابوا وجاهدوا بأموالهم وأنفسهم في سبيل الله أولئك هم الصادقون
en: The believers are only the ones who have believed in Allah and His Messenger and then doubt not but strive with their properties and their lives in the cause of Allah. It is those who are the truthful.

source: قل أتعلمون الله بدينكم والله يعلم ما في السماوات وما في الأرض والله بكل شيء عليم
en: Say, "Would you acquaint Allah with your religion while Allah knows whatever is in the heavens and whatever is on the earth, and Allah is Knowing of all things?"

source: يمنون عليك أن أسلموا قل لا تمنوا علي إسلامكم بل الله يمن عليكم أن هداكم للإيمان إن كنتم صادقين
en: They consider it a favor to you that they have accepted Islam. Say, "Do not consider your Islam a favor to me. Rather, Allah has conferred favor upon you that He has guided you to the faith, if you should be truthful."

source: إن الله يعلم غيب السماوات والأرض والله بصير بما تعملون
en: Indeed, Allah knows the unseen [aspects] of the heavens and the earth. And Allah is Seeing of what you do.

source: ق والقرآن المجيد
en: Qaf. By the honored Qur'an...

source: بل عجبوا أن جاءهم منذر منهم فقال الكافرون هذا شيء عجيب
en: But they wonder that there has come to them a warner from among themselves, and the disbelievers say, "This is an amazing thing.

source: أإذا متنا وكنا ترابا ذلك رجع بعيد
en: When we have died and have become dust, [we will return to life]? That is a distant return."

source: قد علمنا ما تنقص الأرض منهم وعندنا كتاب حفيظ
en: We know what the earth diminishes of them, and with Us is a retaining record.

source: بل كذبوا بالحق لما جاءهم فهم في أمر مريج
en: But they denied the truth when it came to them, so they are in a confused condition.

source: أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيناها وما لها من فروج
en: Have they not looked at the heaven above them - how We structured it and adorned it and [how] it has no rifts?

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل زوج بهيج
en: And the earth - We spread it out and cast therein firmly set mountains and made grow therein [something] of every beautiful kind,

source: تبصرة وذكرى لكل عبد منيب
en: Giving insight and a reminder for every servant who turns [to Allah].

source: ونزلنا من السماء ماء مباركا فأنبتنا به جنات وحب الحصيد
en: And We have sent down blessed rain from the sky and made grow thereby gardens and grain from the harvest

source: والنخل باسقات لها طلع نضيد
en: And lofty palm trees having fruit arranged in layers -

source: رزقا للعباد وأحيينا به بلدة ميتا كذلك الخروج
en: As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection.

source: كذبت قبلهم قوم نوح وأصحاب الرس وثمود
en: The people of Noah denied before them, and the companions of the well and Thamud

source: وعاد وفرعون وإخوان لوط
en: And 'Aad and Pharaoh and the brothers of Lot

source: وأصحاب الأيكة وقوم تبع كل كذب الرسل فحق وعيد
en: And the companions of the thicket and the people of Tubba'. All denied the messengers, so My threat was justly fulfilled.

source: أفعيينا بالخلق الأول بل هم في لبس من خلق جديد
en: Did We fail in the first creation? But they are in confusion over a new creation.

source: ولقد خلقنا الإنسان ونعلم ما توسوس به نفسه ونحن أقرب إليه من حبل الوريد
en: And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein

source: إذ يتلقى المتلقيان عن اليمين وعن الشمال قعيد
en: When the two receivers receive, seated on the right and on the left.

source: ما يلفظ من قول إلا لديه رقيب عتيد
en: Man does not utter any word except that with him is an observer prepared [to record].

source: وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد
en: And the intoxication of death will bring the truth; that is what you were trying to avoid.

source: ونفخ في الصور ذلك يوم الوعيد
en: And the Horn will be blown. That is the Day of [carrying out] the threat.

source: وجاءت كل نفس معها سائق وشهيد
en: And every soul will come, with it a driver and a witness.

source: لقد كنت في غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد
en: [It will be said], "You were certainly in unmindfulness of this, and We have removed from you your cover, so your sight, this Day, is sharp."

source: وقال قرينه هذا ما لدي عتيد
en: And his companion, [the angel], will say, "This [record] is what is with me, prepared."

source: ألقيا في جهنم كل كفار عنيد
en: [Allah will say], "Throw into Hell every obstinate disbeliever,

source: مناع للخير معتد مريب
en: Preventer of good, aggressor, and doubter,

source: الذي جعل مع الله إلها آخر فألقياه في العذاب الشديد
en: Who made [as equal] with Allah another deity; then throw him into the severe punishment."

source: قال قرينه ربنا ما أطغيته ولكن كان في ضلال بعيد
en: His [devil] companion will say, "Our Lord, I did not make him transgress, but he [himself] was in extreme error."

source: قال لا تختصموا لدي وقد قدمت إليكم بالوعيد
en: [Allah] will say, "Do not dispute before Me, while I had already presented to you the warning.

source: ما يبدل القول لدي وما أنا بظلام للعبيد
en: The word will not be changed with Me, and never will I be unjust to the servants."

source: يوم نقول لجهنم هل امتلأت وتقول هل من مزيد
en: On the Day We will say to Hell, "Have you been filled?" and it will say, "Are there some more,"

source: وأزلفت الجنة للمتقين غير بعيد
en: And Paradise will be brought near to the righteous, not far,

source: هذا ما توعدون لكل أواب حفيظ
en: [It will be said], "This is what you were promised - for every returner [to Allah] and keeper [of His covenant]

source: من خشي الرحمن بالغيب وجاء بقلب منيب
en: Who feared the Most Merciful unseen and came with a heart returning [in repentance].

source: ادخلوها بسلام ذلك يوم الخلود
en: Enter it in peace. This is the Day of Eternity."

source: لهم ما يشاءون فيها ولدينا مزيد
en: They will have whatever they wish therein, and with Us is more.

source: وكم أهلكنا قبلهم من قرن هم أشد منهم بطشا فنقبوا في البلاد هل من محيص
en: And how many a generation before them did We destroy who were greater than them in [striking] power and had explored throughout the lands. Is there any place of escape?

source: إن في ذلك لذكرى لمن كان له قلب أو ألقى السمع وهو شهيد
en: Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind].

source: ولقد خلقنا السماوات والأرض وما بينهما في ستة أيام وما مسنا من لغوب
en: And We did certainly create the heavens and earth and what is between them in six days, and there touched Us no weariness.

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب
en: So be patient, [O Muhammad], over what they say and exalt [Allah] with praise of your Lord before the rising of the sun and before its setting,

source: ومن الليل فسبحه وأدبار السجود
en: And [in part] of the night exalt Him and after prostration.

source: واستمع يوم يناد المناد من مكان قريب
en: And listen on the Day when the Caller will call out from a place that is near -

source: يوم يسمعون الصيحة بالحق ذلك يوم الخروج
en: The Day they will hear the blast [of the Horn] in truth. That is the Day of Emergence [from the graves].

source: إنا نحن نحيي ونميت وإلينا المصير
en: Indeed, it is We who give life and cause death, and to Us is the destination

source: يوم تشقق الأرض عنهم سراعا ذلك حشر علينا يسير
en: On the Day the earth breaks away from them [and they emerge] rapidly; that is a gathering easy for Us.

source: نحن أعلم بما يقولون وما أنت عليهم بجبار فذكر بالقرآن من يخاف وعيد
en: We are most knowing of what they say, and you are not over them a tyrant. But remind by the Qur'an whoever fears My threat.

source: والذاريات ذروا
en: By those [winds] scattering [dust] dispersing

source: فالحاملات وقرا
en: And those [clouds] carrying a load [of water]

source: فالجاريات يسرا
en: And those [ships] sailing with ease

source: فالمقسمات أمرا
en: And those [angels] apportioning [each] matter,

source: إنما توعدون لصادق
en: Indeed, what you are promised is true.

source: وإن الدين لواقع
en: And indeed, the recompense is to occur.

source: والسماء ذات الحبك
en: By the heaven containing pathways,

source: إنكم لفي قول مختلف
en: Indeed, you are in differing speech.

source: يؤفك عنه من أفك
en: Deluded away from the Qur'an is he who is deluded.

source: قتل الخراصون
en: Destroyed are the falsifiers

source: الذين هم في غمرة ساهون
en: Who are within a flood [of confusion] and heedless.

source: يسألون أيان يوم الدين
en: They ask, "When is the Day of Recompense?"

source: يوم هم على النار يفتنون
en: [It is] the Day they will be tormented over the Fire

source: ذوقوا فتنتكم هذا الذي كنتم به تستعجلون
en: [And will be told], "Taste your torment. This is that for which you were impatient."

source: آخذين ما آتاهم ربهم إنهم كانوا قبل ذلك محسنين
en: Accepting what their Lord has given them. Indeed, they were before that doers of good.

source: كانوا قليلا من الليل ما يهجعون
en: They used to sleep but little of the night,

source: وبالأسحار هم يستغفرون
en: And in the hours before dawn they would ask forgiveness,

source: وفي أموالهم حق للسائل والمحروم
en: And from their properties was [given] the right of the [needy] petitioner and the deprived.

source: وفي الأرض آيات للموقنين
en: And on the earth are signs for the certain [in faith]

source: وفي أنفسكم أفلا تبصرون
en: And in yourselves. Then will you not see?

source: وفي السماء رزقكم وما توعدون
en: And in the heaven is your provision and whatever you are promised.

source: فورب السماء والأرض إنه لحق مثل ما أنكم تنطقون
en: Then by the Lord of the heaven and earth, indeed, it is truth - just as [sure as] it is that you are speaking.

source: هل أتاك حديث ضيف إبراهيم المكرمين
en: Has there reached you the story of the honored guests of Abraham? -

source: إذ دخلوا عليه فقالوا سلاما قال سلام قوم منكرون
en: When they entered upon him and said, "[We greet you with] peace." He answered, "[And upon you] peace, [you are] a people unknown.

source: فراغ إلى أهله فجاء بعجل سمين
en: Then he went to his family and came with a fat [roasted] calf

source: فقربه إليهم قال ألا تأكلون
en: And placed it near them; he said, "Will you not eat?"

source: فأوجس منهم خيفة قالوا لا تخف وبشروه بغلام عليم
en: And he felt from them apprehension. They said, "Fear not," and gave him good tidings of a learned boy.

source: فأقبلت امرأته في صرة فصكت وجهها وقالت عجوز عقيم
en: And his wife approached with a cry [of alarm] and struck her face and said, "[I am] a barren old woman!"

source: قالوا كذلك قال ربك إنه هو الحكيم العليم
en: They said, "Thus has said your Lord; indeed, He is the Wise, the Knowing."

source: لنرسل عليهم حجارة من طين
en: To send down upon them stones of clay,

source: مسومة عند ربك للمسرفين
en: Marked in the presence of your Lord for the transgressors."

source: فأخرجنا من كان فيها من المؤمنين
en: So We brought out whoever was in the cities of the believers.

source: فما وجدنا فيها غير بيت من المسلمين
en: And We found not within them other than a [single] house of Muslims.

source: وتركنا فيها آية للذين يخافون العذاب الأليم
en: And We left therein a sign for those who fear the painful punishment.

source: وفي موسى إذ أرسلناه إلى فرعون بسلطان مبين
en: And in Moses [was a sign], when We sent him to Pharaoh with clear authority.

source: فتولى بركنه وقال ساحر أو مجنون
en: But he turned away with his supporters and said," A magician or a madman."

source: فأخذناه وجنوده فنبذناهم في اليم وهو مليم
en: So We took him and his soldiers and cast them into the sea, and he was blameworthy.

source: وفي عاد إذ أرسلنا عليهم الريح العقيم
en: And in 'Aad [was a sign], when We sent against them the barren wind.

source: ما تذر من شيء أتت عليه إلا جعلته كالرميم
en: It left nothing of what it came upon but that it made it like disintegrated ruins.

source: وفي ثمود إذ قيل لهم تمتعوا حتى حين
en: And in Thamud, when it was said to them, "Enjoy yourselves for a time."

source: فعتوا عن أمر ربهم فأخذتهم الصاعقة وهم ينظرون
en: But they were insolent toward the command of their Lord, so the thunderbolt seized them while they were looking on.

source: فما استطاعوا من قيام وما كانوا منتصرين
en: And they were unable to arise, nor could they defend themselves.

source: وقوم نوح من قبل إنهم كانوا قوما فاسقين
en: And [We destroyed] the people of Noah before; indeed, they were a people defiantly disobedient.

source: والسماء بنيناها بأيد وإنا لموسعون
en: And the heaven We constructed with strength, and indeed, We are [its] expander.

source: والأرض فرشناها فنعم الماهدون
en: And the earth We have spread out, and excellent is the preparer.

source: ومن كل شيء خلقنا زوجين لعلكم تذكرون
en: And of all things We created two mates; perhaps you will remember.

source: ففروا إلى الله إني لكم منه نذير مبين
en: So flee to Allah. Indeed, I am to you from Him a clear warner.

source: ولا تجعلوا مع الله إلها آخر إني لكم منه نذير مبين
en: And do not make [as equal] with Allah another deity. Indeed, I am to you from Him a clear warner.

source: كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون
en: Similarly, there came not to those before them any messenger except that they said, "A magician or a madman."

source: أتواصوا به بل هم قوم طاغون
en: Did they suggest it to them? Rather, they [themselves] are a transgressing people.

source: فتول عنهم فما أنت بملوم
en: So leave them, [O Muhammad], for you are not to be blamed.

source: وذكر فإن الذكرى تنفع المؤمنين
en: And remind, for indeed, the reminder benefits the believers.

source: وما خلقت الجن والإنس إلا ليعبدون
en: And I did not create the jinn and mankind except to worship Me.

source: ما أريد منهم من رزق وما أريد أن يطعمون
en: I do not want from them any provision, nor do I want them to feed Me.

source: إن الله هو الرزاق ذو القوة المتين
en: Indeed, it is Allah who is the [continual] Provider, the firm possessor of strength.

source: فإن للذين ظلموا ذنوبا مثل ذنوب أصحابهم فلا يستعجلون
en: And indeed, for those who have wronged is a portion [of punishment] like the portion of their predecessors, so let them not impatiently urge Me.

source: فويل للذين كفروا من يومهم الذي يوعدون
en: And woe to those who have disbelieved from their Day which they are promised.

source: والطور
en: By the mount

source: وكتاب مسطور
en: And [by] a Book inscribed

source: في رق منشور
en: In parchment spread open

source: والبيت المعمور
en: And [by] the frequented House

source: والسقف المرفوع
en: And [by] the heaven raised high

source: والبحر المسجور
en: And [by] the sea filled [with fire],

source: إن عذاب ربك لواقع
en: Indeed, the punishment of your Lord will occur.

source: ما له من دافع
en: Of it there is no preventer.

source: يوم تمور السماء مورا
en: On the Day the heaven will sway with circular motion

source: وتسير الجبال سيرا
en: And the mountains will pass on, departing -

source: فويل يومئذ للمكذبين
en: Then woe, that Day, to the deniers,

source: الذين هم في خوض يلعبون
en: Who are in [empty] discourse amusing themselves.

source: يوم يدعون إلى نار جهنم دعا
en: The Day they are thrust toward the fire of Hell with a [violent] thrust, [its angels will say],

source: هذه النار التي كنتم بها تكذبون
en: "This is the Fire which you used to deny.

source: أفسحر هذا أم أنتم لا تبصرون
en: Then is this magic, or do you not see?

source: اصلوها فاصبروا أو لا تصبروا سواء عليكم إنما تجزون ما كنتم تعملون
en: [Enter to] burn therein; then be patient or impatient - it is all the same for you. You are only being recompensed [for] what you used to do."

source: إن المتقين في جنات ونعيم
en: Indeed, the righteous will be in gardens and pleasure,

source: فاكهين بما آتاهم ربهم ووقاهم ربهم عذاب الجحيم
en: Enjoying what their Lord has given them, and their Lord protected them from the punishment of Hellfire.

source: كلوا واشربوا هنيئا بما كنتم تعملون
en: [They will be told], "Eat and drink in satisfaction for what you used to do."

source: متكئين على سرر مصفوفة وزوجناهم بحور عين
en: They will be reclining on thrones lined up, and We will marry them to fair women with large, [beautiful] eyes.

source: والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء كل امرئ بما كسب رهين
en: And those who believed and whose descendants followed them in faith - We will join with them their descendants, and We will not deprive them of anything of their deeds. Every person, for what he earned, is retained.

source: وأمددناهم بفاكهة ولحم مما يشتهون
en: And We will provide them with fruit and meat from whatever they desire.

source: يتنازعون فيها كأسا لا لغو فيها ولا تأثيم
en: They will exchange with one another a cup [of wine] wherein [results] no ill speech or commission of sin.

source: ويطوف عليهم غلمان لهم كأنهم لؤلؤ مكنون
en: There will circulate among them [servant] boys [especially] for them, as if they were pearls well-protected.

source: قالوا إنا كنا قبل في أهلنا مشفقين
en: They will say, "Indeed, we were previously among our people fearful [of displeasing Allah].

source: فمن الله علينا ووقانا عذاب السموم
en: So Allah conferred favor upon us and protected us from the punishment of the Scorching Fire.

source: إنا كنا من قبل ندعوه إنه هو البر الرحيم
en: Indeed, we used to supplicate Him before. Indeed, it is He who is the Beneficent, the Merciful."

source: فذكر فما أنت بنعمت ربك بكاهن ولا مجنون
en: So remind [O Muhammad], for you are not, by the favor of your Lord, a soothsayer or a madman.

source: أم يقولون شاعر نتربص به ريب المنون
en: Or do they say [of you], "A poet for whom we await a misfortune of time?"

source: قل تربصوا فإني معكم من المتربصين
en: Say, "Wait, for indeed I am, with you, among the waiters."

source: أم تأمرهم أحلامهم بهذا أم هم قوم طاغون
en: Or do their minds command them to [say] this, or are they a transgressing people?

source: أم يقولون تقوله بل لا يؤمنون
en: Or do they say, "He has made it up"? Rather, they do not believe.

source: فليأتوا بحديث مثله إن كانوا صادقين
en: Then let them produce a statement like it, if they should be truthful.

source: أم خلقوا من غير شيء أم هم الخالقون
en: Or were they created by nothing, or were they the creators [of themselves]?

source: أم خلقوا السماوات والأرض بل لا يوقنون
en: Or did they create the heavens and the earth? Rather, they are not certain.

source: أم عندهم خزائن ربك أم هم المصيطرون
en: Or have they the depositories [containing the provision] of your Lord? Or are they the controllers [of them]?

source: أم لهم سلم يستمعون فيه فليأت مستمعهم بسلطان مبين
en: Or have they a stairway [into the heaven] upon which they listen? Then let their listener produce a clear authority.

source: أم له البنات ولكم البنون
en: Or has He daughters while you have sons?

source: أم تسألهم أجرا فهم من مغرم مثقلون
en: Or do you, [O Muhammad], ask of them a payment, so they are by debt burdened down?

source: أم عندهم الغيب فهم يكتبون
en: Or have they [knowledge of] the unseen, so they write [it] down?

source: أم يريدون كيدا فالذين كفروا هم المكيدون
en: Or do they intend a plan? But those who disbelieve - they are the object of a plan.

source: أم لهم إله غير الله سبحان الله عما يشركون
en: Or have they a deity other than Allah? Exalted is Allah above whatever they associate with Him.

source: وإن يروا كسفا من السماء ساقطا يقولوا سحاب مركوم
en: And if they were to see a fragment from the sky falling, they would say, "[It is merely] clouds heaped up."

source: فذرهم حتى يلاقوا يومهم الذي فيه يصعقون
en: So leave them until they meet their Day in which they will be struck insensible -

source: يوم لا يغني عنهم كيدهم شيئا ولا هم ينصرون
en: The Day their plan will not avail them at all, nor will they be helped.

source: وإن للذين ظلموا عذابا دون ذلك ولكن أكثرهم لا يعلمون
en: And indeed, for those who have wronged is a punishment before that, but most of them do not know.

source: واصبر لحكم ربك فإنك بأعيننا وسبح بحمد ربك حين تقوم
en: And be patient, [O Muhammad], for the decision of your Lord, for indeed, you are in Our eyes. And exalt [Allah] with praise of your Lord when you arise.

source: ومن الليل فسبحه وإدبار النجوم
en: And in a part of the night exalt Him and after [the setting of] the stars.

source: والنجم إذا هوى
en: By the star when it descends,

source: ما ضل صاحبكم وما غوى
en: Your companion [Muhammad] has not strayed, nor has he erred,

source: وما ينطق عن الهوى
en: Nor does he speak from [his own] inclination.

source: إن هو إلا وحي يوحى
en: It is not but a revelation revealed,

source: علمه شديد القوى
en: Taught to him by one intense in strength -

source: ذو مرة فاستوى
en: One of soundness. And he rose to [his] true form

source: وهو بالأفق الأعلى
en: While he was in the higher [part of the] horizon.

source: ثم دنا فتدلى
en: Then he approached and descended
